Repository: mluszczyk/heura
Catalog: heura/locale/*/LC_MESSAGES/django.po
Languages: pl

source: 404. The page you're looking for hasn't been found.
pl: 404. Strona nie znaleziona.

source: 500. Server error. Please, contact administrator.
pl: 500. Błąd serwera. Proszę, powiadom administratora!

source: 403. Forbidden
pl: 403. Zakaz wstępu

source: Well. You've posted some data, haven't you?
pl: Hm… wrzuciłeś coś, nie?

source: Contest
pl: Konkurs

source: Announced
pl: Ogłoszenie

source: Starts on
pl: Rozpoczęcie

source: Ends on
pl: Zakończenie

source: Fee
pl: Wstęp

source: Number of contestants
pl: Liczba zawodników

source: Prize
pl: Nagroda

source: Expected prize (at least)
pl: Nagroda (przynajmniej)

source: Compete!
pl: Weź udział!

source: Please, pay your entrance fee on: %(address)s and wait for some confirmations.
pl: Przelej Dogecoiny na: %(address)s i poczekaj na parę potwierdzeń.

source: We've already received
pl: Otrzymaliśmy dotychczas

source: Refresh this page to check if your transaction is already executed.
pl: Czekasz na potwierdzenie? Odśwież stronę!

source: You're in! Your key: %(key)s, hash: %(hash)s
pl: Zapraszamy! Twój klucz: %(key)s, hash: %(hash)s

source: Congratulations, you're the winner.
pl: Gratulacje, wygrałeś!

source: You've already withdrawn your prize
pl: Odebrałeś już nagrodę

source: Transaction
pl: Transakcja

source: Withdraw your prize now!
pl: Odbierz nagrodę!

source: Task
pl: Zadanie

source: Results
pl: Wyniki

source: Contestant
pl: Zawodnik

source: Full score
pl: Łączny wynik

source: Last submit
pl: Ostatnie zgłoszenie

source: Er, no participants? Really?
pl: Nikt nie wziął udziału :<

source: Input data
pl: Dane wejściowe

source: Input
pl: Wejście

source: Download
pl: Pobierz

source: Submit output
pl: Wyślij odpowiedź

source: Sorry, there are no inputs yet.
pl: Brak plików wejściowych

source: Submissions
pl: Zgłoszenia

source: Date
pl: Data

source: Input no.
pl: Wejście nr

source: Score
pl: Wynik

source: No submissions.
pl: Brak zgłoszeń.

source: It's your magic key. Please, keep it, because we won't.
pl: To Twój magiczny klucz. Nie będziemy go nigdzie zapisywać, to Twoja sprawa

source: Now you should move to
pl: Teraz przejdź do

source: this page
pl: tej strony

source: Compete for Dogecoins!
pl: Walcz o Dogecoiny

source: Compete at Dobraheura!
pl: Walcz jak lew na Dobrejheurze!

source: A brand new platform for algorithmic competitions. Let your approximations fight for your Doges!
pl: Nowiutki algorytmiczny ring. Wrzucaj heury i zbieraj Dogecoiny!

source: View
pl: Zobacz

source: Compete
pl: Weź udział

source: Over
pl: Koniec

source: Sorry, there's nothing I can show you. Please, come again later!
pl: Niestety, nie ma tu nic ciekawego. Ale przyjdź, niedługo będzie!

source: <h2>Getting started</h2> <p>Before you can start competing, you should have a <a href="http://dogecoin.com">Dogecoin</a> wallet and some coins in it to pay entrance fee. Don't worry, you will get those just for creating a new wallet on <a href="http://dogeapi.com">DogeAPI</a> or taking a walk through a few Dogecoin <i>faucets</i>.</p> <p>Good luck!</p> <h2>Fees and prizes</h2> <p>To enter a contest you have to pay a nominal entrance fee (in Dogecoins). As soon as the contest ends, the winner receives a prize, which he can withdraw to the address he provides.</p> <p>Currently, using the service is free of charge and all participants' entrance fees are paid back to the winner. This may change in the future, but you will be warned before it happens on this site.</p> <p>As using the service is free, we gently ask for generous donations!</p>
pl: <p>Śmiszny tekst</p>

source: <p>It's not easy to find the longest cycle in a general graph. You're given a simple graph (<i>i.e.</i> undirected, without multiedges and loops). Your task is to find a simple cycle in it (a path that begins and ends in the same vertex, but goes through any edge and vertex at most once). The longer cycle you find, the more points you get.</p> <p>Vertices are numbered from 1. You can assume that there exists at least one cycle of length at least 3 in each input graph.</p> <p><b>Input:</b> In the first line there are numbers <i>n</i> and <i>m</i> – the number of vertices and edges. In the next <i>m</i> lines follow integers <i>a</i> and <i>b</i>, which mean, that an edge connects vertices <i>a</i> and <i>b</i>.</p> <p><b>Output:</b> The correct output consists of two lines. The first contains the length of the cycle you've found, and the next should be the list of numbers of subsequent vertices.</p> <p>Remember, you never have to find the longest possible cycle! It's usually impossible! Your answer should contain a cycle of any length. However, longer cycles recieve more points.</p>
pl: <p>Szukanie najdłuższego cyklu w grafie to bardzo trudny problem. Twoim zadaniem jest znalezienie w podanym grafie prostym (czyli grafie nieskierowanym bez pętli i wielokrotnych krawędzi). jak najdłuższego cyklu prostego (czyli ścieżki, która zaczyna się i kończy w tym samym wierzchołku i przez każdy wierzchołek przechodzi co najwyżej raz).</p> <p>Wierzchołki numerujemy kolejnymi liczbami naturalnymi od 1. Możesz założyć, że w każdym grafie na wejściu istnieje przynajmniej jeden cykl o długości przynajmniej 3.</p><p><b>Wejście:</b> Pierwsza linia wejścia zawiera liczby <i>n</i> i <i>m</i>, czyli odpowiednio liczbę wierzchołków i krawędzi. Kolejne <i>m</i> linii to opisy krawędzi: liczby <i>a</i> i <i>b</i>, oznaczające, że wierzchołki <i>a</i> i <i>b</i> są połączone krawędzią.<p> <p><b>Wyjście:</b> Prawidłowe wyjście składa się z dwóch linii. Piewrsza z nich to długość znalezionego cyklu, a druga to numery kolejnych wierzchołków tego cyklu. Możesz zacząć od dowolnego wierzchołka. Każdy wierzchołek wypisz co najwyżej raz.</p> <p>Pamiętaj! W tym zadaniu nie chodzi o znalezienie najdłuższego cyklu w grafie. W większości przypadków takie zadanie byłoby niemożliwe do wykonania. Znajdź dowolny cykl. Im będzie dłuższy, tym więcej punktów dostaniesz</p>

source: Submit
pl: Wyślij odpowiedź
